<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="null">
    <meta name="keyword"  content="undefined">
    <link rel="shortcut icon" href="/img/coffee.png">

    <title>
        
          undefined
        
    </title>

    <link rel="canonical" href="http://yoursite.com/2016/04/17/1-图层树/图层树/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/blog-style.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/css/syntax.css">

    <!-- Custom Fonts -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
</head>

<style>
    .intro-header{
        background-image:url(
        'undefined'
        )
    }
</style>
<!-- hack iOS CSS :active style -->
<body ontouchstart="">
<!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top " data-ispost = "true" data-istags="false
" data-ishome = "false" >
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">
                <span class="brand-logo">
                    SONG BO
                </span>
                's Blog
            </a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <!-- /.navbar-collapse -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                </ul>
            </div>
        </div>
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>

    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!--only post-->
<img class="wechat-title-img" src="undefined">

<!-- Post Header -->
<!-- only post bg-->
<style type="text/css">
    header.intro-header{
        background-image: url('undefined')
    }
</style>

<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1 text-center">
                <div class="post-heading">
                    <h1></h1>
                    
                    <span class="meta">
                         作者 SONG BO
                         <span>
                          日期 2016-04-17
                         </span>
                    </span>
                    <div class="tags text-center">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>
    <div class="post-title-haojen">
        <span>
            
        </span>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">
                <!-- Post Container -->
            <div class="col-lg-8 col-lg-offset-1 col-sm-9 post-container">

                <p>#&#x56FE;&#x5C42;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;</p>
<blockquote>
<p>&#x5DE8;&#x5996;&#x6709;&#x56FE;&#x5C42;&#xFF0C;&#x6D0B;&#x8471;&#x4E5F;&#x6709;&#x56FE;&#x5C42;&#xFF0C;&#x4F60;&#x6709;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x90FD;&#x6709;&#x56FE;&#x5C42; &#x2013; &#x53F2;&#x83B1;&#x514B;</p>
</blockquote>
<p>Core Animation&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x8BEF;&#x89E3;&#x7684;&#x547D;&#x540D;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#x5B83;&#x53EA;&#x662F;&#x7528;&#x6765;&#x505A;&#x52A8;&#x753B;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<em>Layer Kit</em>&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x4E0D;&#x600E;&#x4E48;&#x548C;&#x52A8;&#x753B;&#x6709;&#x5173;&#x7684;&#x540D;&#x5B57;&#x6F14;&#x53D8;&#x800C;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x505A;&#x52A8;&#x753B;&#x8FD9;&#x53EA;&#x662F;Core Animation&#x7279;&#x6027;&#x7684;&#x51B0;&#x5C71;&#x4E00;&#x89D2;&#x3002;</p>
<p>Core Animation&#x662F;&#x4E00;&#x4E2A;<em>&#x590D;&#x5408;&#x5F15;&#x64CE;</em>&#xFF0C;&#x5B83;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x7EC4;&#x5408;&#x5C4F;&#x5E55;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x53EF;&#x89C6;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x5185;&#x5BB9;&#x662F;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x72EC;&#x7ACB;&#x7684;<em>&#x56FE;&#x5C42;</em>&#xFF0C;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<em>&#x56FE;&#x5C42;&#x6811;</em>&#x7684;&#x4F53;&#x7CFB;&#x4E4B;&#x4E2D;&#x3002;&#x4E8E;&#x662F;&#x8FD9;&#x4E2A;&#x6811;&#x5F62;&#x6210;&#x4E86;<strong>UIKit</strong>&#x4EE5;&#x53CA;&#x5728;iOS&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F53;&#x4E2D;&#x4F60;&#x6240;&#x80FD;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x770B;&#x89C1;&#x7684;&#x4E00;&#x5207;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x52A8;&#x753B;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x56FE;&#x5C42;&#x6811;&#x5F00;&#x59CB;&#xFF0C;&#x6D89;&#x53CA;&#x4E00;&#x4E0B;Core Animation&#x7684;<em>&#x9759;&#x6001;</em>&#x7EC4;&#x5408;&#x4EE5;&#x53CA;&#x5E03;&#x5C40;&#x7279;&#x6027;&#x3002;</p>
<p>##&#x56FE;&#x5C42;&#x548C;&#x89C6;&#x56FE;<br>&#x5982;&#x679C;&#x4F60;&#x66FE;&#x7ECF;&#x5728;iOS&#x6216;&#x8005;Mac OS&#x5E73;&#x53F0;&#x4E0A;&#x5199;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;<em>&#x89C6;&#x56FE;</em>&#x7684;&#x6982;&#x5FF5;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x3002;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x5C31;&#x662F;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x5757;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x7247;&#xFF0C;&#x6587;&#x5B57;&#x6216;&#x8005;&#x89C6;&#x9891;&#xFF09;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x62E6;&#x622A;&#x7C7B;&#x4F3C;&#x4E8E;&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x6216;&#x8005;&#x89E6;&#x6478;&#x624B;&#x52BF;&#x7B49;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3002;&#x89C6;&#x56FE;&#x5728;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x4E2D;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x5D4C;&#x5957;&#xFF0C;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x5B83;&#x7684;&#x6240;&#x6709;&#x5B50;&#x89C6;&#x56FE;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x56FE;1.1&#x663E;&#x793A;&#x4E86;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;</p>
<p><img src="/2016/04/17/1-&#x56FE;&#x5C42;&#x6811;/&#x56FE;&#x5C42;&#x6811;/./1.1.jpeg" alt="/1-&#x56FE;&#x5C42;&#x6811;" title="1-&#x56FE;&#x5C42;&#x6811;" width="700"></p>
<p>&#x56FE;1.1 &#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;iOS&#x5C4F;&#x5E55;&#xFF08;&#x5DE6;&#x8FB9;&#xFF09;&#x548C;&#x5F62;&#x6210;&#x89C6;&#x56FE;&#x7684;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#xFF08;&#x53F3;&#x8FB9;&#xFF09;</p>
<p>&#x5728;iOS&#x5F53;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x89C6;&#x56FE;&#x90FD;&#x4ECE;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code>UIVIew</code>&#x7684;&#x57FA;&#x7C7B;&#x6D3E;&#x751F;&#x800C;&#x6765;&#xFF0C;<code>UIView</code>&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x57FA;&#x4E8E;<em>Core Graphics</em>&#x7ED8;&#x56FE;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x4EFF;&#x5C04;&#x53D8;&#x6362;&#xFF08;&#x4F8B;&#x5982;&#x65CB;&#x8F6C;&#x6216;&#x8005;&#x7F29;&#x653E;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E;&#x6ED1;&#x52A8;&#x6216;&#x8005;&#x6E10;&#x53D8;&#x7684;&#x52A8;&#x753B;&#x3002;</p>
<p>###CALayer<br><code>CALayer</code>&#x7C7B;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x548C;<code>UIView</code>&#x7C7B;&#x4F3C;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x662F;&#x4E00;&#x4E9B;&#x88AB;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x6811;&#x7BA1;&#x7406;&#x7684;&#x77E9;&#x5F62;&#x5757;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#xFF08;&#x50CF;&#x56FE;&#x7247;&#xFF0C;&#x6587;&#x672C;&#x6216;&#x8005;&#x80CC;&#x666F;&#x8272;&#xFF09;&#xFF0C;&#x7BA1;&#x7406;&#x5B50;&#x56FE;&#x5C42;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5B83;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x548C;&#x5C5E;&#x6027;&#x7528;&#x6765;&#x505A;&#x52A8;&#x753B;&#x548C;&#x53D8;&#x6362;&#x3002;&#x548C;<code>UIView</code>&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x662F;<code>CALayer</code>&#x4E0D;&#x5904;&#x7406;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p><code>CALayer</code>&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x5177;&#x4F53;&#x7684;<em>&#x54CD;&#x5E94;&#x94FE;</em>&#xFF08;iOS&#x901A;&#x8FC7;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x7528;&#x6765;&#x4F20;&#x9001;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x7684;&#x673A;&#x5236;&#xFF09;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x5E76;&#x4E0D;&#x80FD;&#x591F;&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x4E00;&#x4E2A;&#x89E6;&#x70B9;&#x5728;&#x56FE;&#x5C42;&#x7684;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF08;&#x5177;&#x4F53;&#x89C1;&#x7B2C;&#x4E09;&#x7AE0;&#xFF0C;&#x201C;&#x56FE;&#x5C42;&#x7684;&#x51E0;&#x4F55;&#x5B66;&#x201D;&#xFF09;</p>
<p>###&#x5E73;&#x884C;&#x7684;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;<br>&#x6BCF;&#x4E00;&#x4E2A;<code>UIview</code>&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>CALayer</code>&#x5B9E;&#x4F8B;&#x7684;&#x56FE;&#x5C42;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<em>backing layer</em>&#xFF0C;&#x89C6;&#x56FE;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x5E76;&#x7BA1;&#x7406;&#x8FD9;&#x4E2A;&#x56FE;&#x5C42;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5F53;&#x5B50;&#x89C6;&#x56FE;&#x5728;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x4E2D;&#x6DFB;&#x52A0;&#x6216;&#x8005;&#x88AB;&#x79FB;&#x9664;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x5173;&#x8054;&#x7684;&#x56FE;&#x5C42;&#x4E5F;&#x540C;&#x6837;&#x5BF9;&#x5E94;&#x5728;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x6811;&#x5F53;&#x4E2D;&#x6709;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x89C1;&#x56FE;1.2&#xFF09;&#x3002;</p>
<p><img src="/2016/04/17/1-&#x56FE;&#x5C42;&#x6811;/&#x56FE;&#x5C42;&#x6811;/./1.2.jpeg" alt="&#x56FE;1.2" title="&#x56FE;1.2" width="700"></p>
<p>&#x56FE;1.2 &#x56FE;&#x5C42;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF08;&#x5DE6;&#x8FB9;&#xFF09;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#xFF08;&#x53F3;&#x8FB9;&#xFF09;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E9B;&#x80CC;&#x540E;&#x5173;&#x8054;&#x7684;&#x56FE;&#x5C42;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7528;&#x6765;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x548C;&#x505A;&#x52A8;&#x753B;&#xFF0C;<code>UIView</code>&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x5C01;&#x88C5;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;iOS&#x7C7B;&#x4F3C;&#x4E8E;&#x5904;&#x7406;&#x89E6;&#x6478;&#x7684;&#x5177;&#x4F53;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x53CA;Core Animation&#x5E95;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x9AD8;&#x7EA7;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;iOS&#x8981;&#x57FA;&#x4E8E;<code>UIView</code>&#x548C;<code>CALayer</code>&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x5E73;&#x884C;&#x7684;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5C42;&#x7EA7;&#x6765;&#x5904;&#x7406;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x8981;&#x505A;&#x804C;&#x8D23;&#x5206;&#x79BB;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x80FD;&#x907F;&#x514D;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x3002;&#x5728;iOS&#x548C;Mac OS&#x4E24;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x4E8B;&#x4EF6;&#x548C;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x57FA;&#x4E8E;&#x591A;&#x70B9;&#x89E6;&#x63A7;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x548C;&#x57FA;&#x4E8E;&#x9F20;&#x6807;&#x952E;&#x76D8;&#x6709;&#x7740;&#x672C;&#x8D28;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;iOS&#x6709;UIKit&#x548C;<code>UIView</code>&#xFF0C;&#x4F46;&#x662F;Mac OS&#x6709;AppKit&#x548C;<code>NSView</code>&#x7684;&#x539F;&#x56E0;&#x3002;&#x4ED6;&#x4EEC;&#x529F;&#x80FD;&#x4E0A;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x73B0;&#x4E0A;&#x6709;&#x7740;&#x663E;&#x8457;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>&#x7ED8;&#x56FE;&#xFF0C;&#x5E03;&#x5C40;&#x548C;&#x52A8;&#x753B;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#x5C31;&#x662F;&#x7C7B;&#x4F3C;Mac&#x7B14;&#x8BB0;&#x672C;&#x548C;&#x684C;&#x9762;&#x7CFB;&#x5217;&#x4E00;&#x6837;&#x5E94;&#x7528;&#x4E8E;iPhone&#x548C;iPad&#x89E6;&#x5C4F;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x628A;&#x8FD9;&#x79CD;&#x529F;&#x80FD;&#x7684;&#x903B;&#x8F91;&#x5206;&#x5F00;&#x5E76;&#x5E94;&#x7528;&#x5230;&#x72EC;&#x7ACB;&#x7684;Core Animation&#x6846;&#x67B6;&#xFF0C;&#x82F9;&#x679C;&#x5C31;&#x80FD;&#x591F;&#x5728;iOS&#x548C;Mac OS&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5F97;&#x5BF9;&#x82F9;&#x679C;&#x81EA;&#x5DF1;&#x7684;OS&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x548C;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x53D1;&#x8005;&#x53BB;&#x5F00;&#x53D1;&#x4E24;&#x4E2A;&#x5E73;&#x53F0;&#x7684;&#x5E94;&#x7528;&#x66F4;&#x52A0;&#x4FBF;&#x6377;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x662F;&#x4E24;&#x4E2A;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x662F;&#x56DB;&#x4E2A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x626E;&#x6F14;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x9664;&#x4E86;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#x548C;&#x56FE;&#x5C42;&#x6811;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5B58;&#x5728;<em>&#x5448;&#x73B0;&#x6811;</em>&#x548C;<em>&#x6E32;&#x67D3;&#x6811;</em>&#xFF0C;&#x5C06;&#x5728;&#x7B2C;&#x4E03;&#x7AE0;&#x201C;&#x9690;&#x5F0F;&#x52A8;&#x753B;&#x201D;&#x548C;&#x7B2C;&#x5341;&#x4E8C;&#x7AE0;&#x201C;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x201D;&#x5206;&#x522B;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>##&#x56FE;&#x5C42;&#x7684;&#x80FD;&#x529B;<br>&#x5982;&#x679C;&#x8BF4;<code>CALayer</code>&#x662F;<code>UIView</code>&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5168;&#x9762;&#x5730;&#x4E86;&#x89E3;&#x5B83;&#x5462;&#xFF1F;&#x82F9;&#x679C;&#x5F53;&#x7136;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4F18;&#x7F8E;&#x7B80;&#x6D01;&#x7684;<code>UIView</code>&#x63A5;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x5C31;&#x6CA1;&#x5FC5;&#x8981;&#x76F4;&#x63A5;&#x53BB;&#x5904;&#x7406;Core Animation&#x7684;&#x7EC6;&#x8282;&#x4E86;&#x5462;&#xFF1F;</p>
<p>&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#x7684;&#x786E;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x9700;&#x6C42;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x6CA1;&#x5FC5;&#x8981;&#x5904;&#x7406;<code>CALayer</code>&#xFF0C;&#x56E0;&#x4E3A;&#x82F9;&#x679C;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;<code>UIView</code>&#x7684;&#x9AD8;&#x7EA7;API&#x95F4;&#x63A5;&#x5730;&#x4F7F;&#x5F97;&#x52A8;&#x753B;&#x53D8;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x7075;&#x6D3B;&#x4E0A;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7565;&#x5FAE;&#x60F3;&#x5728;&#x5E95;&#x5C42;&#x505A;&#x4E00;&#x4E9B;&#x6539;&#x53D8;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x82F9;&#x679C;&#x6CA1;&#x6709;&#x5728;<code>UIView</code>&#x4E0A;&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x65F6;&#x9664;&#x4E86;&#x4ECB;&#x5165;Core Animation&#x5E95;&#x5C42;&#x4E4B;&#x5916;&#x522B;&#x65E0;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BC1;&#x5B9E;&#x4E86;&#x56FE;&#x5C42;&#x4E0D;&#x80FD;&#x50CF;&#x89C6;&#x56FE;&#x90A3;&#x6837;&#x5904;&#x7406;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x80FD;&#x505A;&#x54EA;&#x4E9B;&#x89C6;&#x56FE;&#x4E0D;&#x80FD;&#x505A;&#x7684;&#x5462;&#xFF1F;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;<code>UIView</code>&#x6CA1;&#x6709;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x7684;CALayer&#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li>&#x9634;&#x5F71;&#xFF0C;&#x5706;&#x89D2;&#xFF0C;&#x5E26;&#x989C;&#x8272;&#x7684;&#x8FB9;&#x6846;</li>
<li>3D&#x53D8;&#x6362;</li>
<li>&#x975E;&#x77E9;&#x5F62;&#x8303;&#x56F4;</li>
<li>&#x900F;&#x660E;&#x906E;&#x7F69;</li>
<li>&#x591A;&#x7EA7;&#x975E;&#x7EBF;&#x6027;&#x52A8;&#x753B;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x4E2D;&#x63A2;&#x7D22;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x5173;&#x6CE8;&#x4E00;&#x4E0B;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F53;&#x4E2D;<code>CALayer</code>&#x662F;&#x600E;&#x6837;&#x88AB;&#x5229;&#x7528;&#x8D77;&#x6765;&#x7684;&#x3002;</p>
<p>##&#x4F7F;&#x7528;&#x56FE;&#x5C42;<br>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6765;&#x64CD;&#x7EB5;&#x4E00;&#x4E9B;<code>layer</code>&#x7684;&#x5C5E;&#x6027;&#x3002;&#x6253;&#x5F00;Xcode&#xFF0C;&#x4F7F;&#x7528;<em>Single View Application</em>&#x6A21;&#x677F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x5C4F;&#x5E55;&#x4E2D;&#x592E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5C0F;&#x89C6;&#x56FE;&#xFF08;&#x5927;&#x7EA6;200 X 200&#x7684;&#x5C3A;&#x5BF8;&#xFF09;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x624B;&#x5DE5;&#x7F16;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;Interface Builder&#xFF08;&#x968F;&#x4F60;&#x65B9;&#x4FBF;&#xFF09;&#x3002;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x89C6;&#x56FE;&#x63A7;&#x5236;&#x5668;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x7684;&#x5C5E;&#x6027;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x79F0;&#x4F5C;<code>layerView</code>&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x9879;&#x76EE;&#xFF0C;&#x5E94;&#x8BE5;&#x80FD;&#x5728;&#x6D45;&#x7070;&#x8272;&#x5C4F;&#x5E55;&#x80CC;&#x666F;&#x4E2D;&#x770B;&#x89C1;&#x4E00;&#x4E2A;&#x767D;&#x8272;&#x65B9;&#x5757;&#xFF08;&#x56FE;1.3&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x770B;&#x89C1;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8C03;&#x6574;&#x4E00;&#x4E0B;&#x80CC;&#x666F;window&#x6216;&#x8005;view&#x7684;&#x989C;&#x8272;</p>
<p><img src="/2016/04/17/1-&#x56FE;&#x5C42;&#x6811;/&#x56FE;&#x5C42;&#x6811;/./1.3.jpeg" alt="&#x56FE;1.3" title="&#x56FE;1.3" width="700"></p>
<p>&#x56FE;1.3 &#x7070;&#x8272;&#x80CC;&#x666F;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x767D;&#x8272;<code>UIView</code></p>
<p>&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4EE4;&#x4EBA;&#x6FC0;&#x52A8;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8272;&#x5757;&#xFF0C;&#x5728;&#x767D;&#x8272;&#x65B9;&#x5757;&#x4E2D;&#x95F4;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x84DD;&#x8272;&#x5757;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5728;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;<code>UIView</code>&#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B50;&#x89C6;&#x56FE;&#xFF08;&#x968F;&#x610F;&#x7528;&#x4EE3;&#x7801;&#x6216;&#x8005;IB&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5B66;&#x5230;&#x4EFB;&#x4F55;&#x5173;&#x4E8E;&#x56FE;&#x5C42;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>CALayer</code>&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x5B83;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x89C6;&#x56FE;&#x76F8;&#x5173;&#x56FE;&#x5C42;&#x7684;&#x5B50;&#x56FE;&#x5C42;&#x3002;&#x5C3D;&#x7BA1;<code>UIView</code>&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x4E2D;&#x66B4;&#x9732;&#x4E86;&#x56FE;&#x5C42;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x6807;&#x51C6;&#x7684;Xcode&#x9879;&#x76EE;&#x6A21;&#x677F;&#x5E76;&#x6CA1;&#x6709;&#x5305;&#x542B;Core Animation&#x76F8;&#x5173;&#x5934;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x7ED9;&#x9879;&#x76EE;&#x6DFB;&#x52A0;&#x5408;&#x9002;&#x7684;&#x5E93;&#xFF0C;&#x662F;&#x4E0D;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x56FE;&#x5C42;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x8BBF;&#x95EE;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x6240;&#x4EE5;&#x9996;&#x5148;&#x9700;&#x8981;&#x6DFB;&#x52A0;QuartzCore&#x6846;&#x67B6;&#x5230;Build Phases&#x6807;&#x7B7E;&#xFF08;&#x56FE;1.4&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;vc&#x7684;.m&#x6587;&#x4EF6;&#x4E2D;&#x5F15;&#x5165;<quartzcore quartzcore.h="">&#x5E93;&#x3002;</quartzcore></p>
<p><img src="/2016/04/17/1-&#x56FE;&#x5C42;&#x6811;/&#x56FE;&#x5C42;&#x6811;/./1.4.jpeg" alt="&#x56FE;1.4" title="&#x56FE;1.4" width="700"></p>
<p>&#x56FE;1.4 &#x628A;QuartzCore&#x5E93;&#x6DFB;&#x52A0;&#x5230;&#x9879;&#x76EE;</p>
<p>&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x76F4;&#x63A5;&#x5F15;&#x7528;<code>CALayer</code>&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6E05;&#x5355;1.1&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;<code>CALayer</code>&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;&#x5B83;&#x7684;<code>backgroundColor</code>&#x5C5E;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x5230;<code>layerView</code>&#x80CC;&#x540E;&#x76F8;&#x5173;&#x56FE;&#x5C42;&#x7684;&#x5B50;&#x56FE;&#x5C42;&#xFF08;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x524D;&#x63D0;&#x662F;&#x901A;&#x8FC7;IB&#x521B;&#x5EFA;&#x4E86;<code>layerView</code>&#x5E76;&#x505A;&#x597D;&#x4E86;&#x8FDE;&#x63A5;&#xFF09;&#xFF0C;&#x56FE;1.5&#x663E;&#x793A;&#x4E86;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6E05;&#x5355;1.1 &#x7ED9;&#x89C6;&#x56FE;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x84DD;&#x8272;&#x5B50;&#x56FE;&#x5C42;</p>
<pre><code class="objective-c">#import &quot;ViewController.h&quot;
#import &lt;QuartzCore/QuartzCore.h&gt;
@interface ViewController ()

@property (nonatomic, weak) IBOutlet UIView *layerView;
&#xFFFC;
@end

@implementation ViewController

- (void)viewDidLoad
{
    [super viewDidLoad];
    //create sublayer
    CALayer *blueLayer = [CALayer layer];
    blueLayer.frame = CGRectMake(50.0f, 50.0f, 100.0f, 100.0f);
    blueLayer.backgroundColor = [UIColor blueColor].CGColor;
    //add it to our view
    [self.layerView.layer addSublayer:blueLayer];
}
@end
</code></pre>
<p><img src="/2016/04/17/1-&#x56FE;&#x5C42;&#x6811;/&#x56FE;&#x5C42;&#x6811;/./1.5.jpeg" alt="&#x56FE;1.5" title="&#x56FE;1.5" width="700"></p>
<p>&#x56FE;1.5 &#x767D;&#x8272;<code>UIView</code>&#x5185;&#x90E8;&#x5D4C;&#x5957;&#x7684;&#x84DD;&#x8272;<code>CALayer</code></p>
<p>&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x76F8;&#x5173;&#x8054;&#x7684;&#x56FE;&#x5C42;&#xFF08;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x6DFB;&#x52A0;&#x65E0;&#x6570;&#x591A;&#x4E2A;&#x5B50;&#x56FE;&#x5C42;&#xFF0C;&#x4ECE;&#x6E05;&#x5355;1.1&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x56FE;&#x5C42;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x5B83;&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x5230;&#x89C6;&#x56FE;&#x5173;&#x8054;&#x56FE;&#x5C42;&#x7684;&#x5B50;&#x56FE;&#x5C42;&#x3002;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6DFB;&#x52A0;&#x56FE;&#x5C42;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x89C1;&#x7B80;&#x5355;&#x5730;&#x5904;&#x7406;&#x89C6;&#x56FE;&#xFF0C;&#x4ED6;&#x4EEC;&#x5173;&#x8054;&#x7684;&#x56FE;&#x5C42;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x5730;&#x624B;&#x52A8;&#x6DFB;&#x52A0;&#x5B50;&#x56FE;&#x5C42;&#x3002;</p>
<p>&#x5728;Mac OS&#x5E73;&#x53F0;&#xFF0C;10.8&#x7248;&#x672C;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x6027;&#x80FD;&#x7F3A;&#x9677;&#x5C31;&#x662F;&#x7531;&#x4E8E;&#x7528;&#x4E86;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x72EC;&#x5728;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x5185;&#x4F7F;&#x7528;<code>CALayer</code>&#x6811;&#x72B6;&#x5C42;&#x7EA7;&#x3002;&#x4F46;&#x662F;&#x5728;iOS&#x5E73;&#x53F0;&#xFF0C;&#x4F7F;&#x7528;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;<code>UIView</code>&#x7C7B;&#x5E76;&#x6CA1;&#x6709;&#x663E;&#x8457;&#x7684;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#xFF08;&#x5F53;&#x7136;&#x5728;Mac OS 10.8&#x4E4B;&#x540E;&#xFF0C;<code>NSView</code>&#x7684;&#x6027;&#x80FD;&#x540C;&#x6837;&#x4E5F;&#x5F97;&#x5230;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x63D0;&#x9AD8;&#xFF09;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x56FE;&#x5C42;&#x5173;&#x8054;&#x7684;&#x89C6;&#x56FE;&#x800C;&#x4E0D;&#x662F;<code>CALayer</code>&#x7684;&#x597D;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x80FD;&#x5728;&#x4F7F;&#x7528;&#x6240;&#x6709;<code>CALayer</code>&#x5E95;&#x5C42;&#x7279;&#x6027;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>UIView</code>&#x7684;&#x9AD8;&#x7EA7;API&#xFF08;&#x6BD4;&#x5982;&#x81EA;&#x52A8;&#x6392;&#x7248;&#xFF0C;&#x5E03;&#x5C40;&#x548C;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF09;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x66F4;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>CALayer</code>&#x800C;&#x4E0D;&#x662F;<code>UIView</code></p>
<ul>
<li>&#x5F00;&#x53D1;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x5728;Mac OS&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x8DE8;&#x5E73;&#x53F0;&#x5E94;&#x7528;</li>
<li>&#x4F7F;&#x7528;&#x591A;&#x79CD;<code>CALayer</code>&#x7684;&#x5B50;&#x7C7B;&#xFF08;&#x89C1;&#x7B2C;&#x516D;&#x7AE0;&#xFF0C;&#x201C;&#x7279;&#x6B8A;&#x7684;&#x56FE;&#x5C42;&#x201C;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x60F3;&#x521B;&#x5EFA;&#x989D;&#x5916;&#x7684;<code>UIView</code>&#x53BB;&#x5305;&#x5C01;&#x88C5;&#x5B83;&#x4EEC;&#x6240;&#x6709;</li>
<li>&#x505A;&#x4E00;&#x4E9B;&#x5BF9;&#x6027;&#x80FD;&#x7279;&#x522B;&#x6311;&#x5254;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;<code>UIView</code>&#x4E00;&#x4E9B;&#x53EF;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x5F15;&#x8D77;&#x663E;&#x8457;&#x7684;&#x4E0D;&#x540C;&#xFF08;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x76F4;&#x63A5;&#x60F3;&#x4F7F;&#x7528;OpenGL&#x7ED8;&#x56FE;&#xFF09;</li>
</ul>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x90FD;&#x5F88;&#x5C11;&#x89C1;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x5904;&#x7406;&#x89C6;&#x56FE;&#x4F1A;&#x6BD4;&#x5355;&#x72EC;&#x5904;&#x7406;&#x56FE;&#x5C42;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x3002;</p>
<p>##&#x603B;&#x7ED3;<br>&#x8FD9;&#x4E00;&#x7AE0;&#x9610;&#x8FF0;&#x4E86;&#x56FE;&#x5C42;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x5982;&#x4F55;&#x5728;iOS&#x4E2D;&#x7531;<code>UIView</code>&#x7684;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x5F62;&#x6210;&#x7684;&#x4E00;&#x79CD;&#x5E73;&#x884C;&#x7684;<code>CALayer</code>&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x7684;&#x5B9E;&#x9A8C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;<code>CALayer</code>&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x6DFB;&#x52A0;&#x5230;&#x56FE;&#x5C42;&#x6811;&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF0C;&#x201C;&#x56FE;&#x5C42;&#x5173;&#x8054;&#x7684;&#x56FE;&#x7247;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7814;&#x7A76;&#x4E00;&#x4E0B;<code>CALayer</code>&#x5173;&#x8054;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4EE5;&#x53CA;Core Animation&#x63D0;&#x4F9B;&#x7684;&#x64CD;&#x4F5C;&#x663E;&#x793A;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x3002;</p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/2016/07/16/hello-world/" data-toggle="tooltip" data-placement="top" title="Hello World">&larr; Previous Post</a>
                        </li>
                    
                    
                </ul>

                

                

            </div>

            <div class="hidden-xs col-sm-3 toc-col" >
                <div class="toc-wrap">
                    
                </div>
            </div>
        </div>

        <div class="row">
            <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                

                <!-- Friends Blog -->
                
            </div>
        </div>

    </div>
</article>








    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                

                

                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; SONG BO 2016 
                    <br>
                    <!--Theme by <a href="https://github.com/Kaijun/">Kaijun</a>-->
                    <!--<span style="display: inline-block; margin: 0 5px;">-->
                        <!--<i class="fa fa-heart"></i>-->
                    <!--</span> -->
                    Theme by <a href="http://ehazon.github.io/">Haojen Ma</a>
                    <!--<iframe-->
                        <!--style="margin-left: 2px; margin-bottom:-5px;"-->
                        <!--frameborder="0" scrolling="0" width="91px" height="20px"-->
                        <!--src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >-->
                    <!--</iframe>-->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/js/blog.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://yoursite.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->


<!-- Side Catalog -->


    <!--wechat title img-->
    <img class="wechat-title-img" src="undefined">
</body>

</html>
